src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="https://pavlovaleksei.github.io">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getServerTimeRequest/>
    </soapenv:Body>
</soapenv:Envelope>